# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

# number = input("Введите любое целое положительное число: ")
number = "18927"
i = 0


# max = number[0]
# while(i < len(number)):
#     if max < number[i]:
#         max = number[i]
#     i += 1
#
# print(max)
